package com.shui.nasor.Model.Bean.Relax;

import com.google.gson.Gson;

import java.io.Serializable;
import java.util.List;

/**
 * 作者： max_Shui on 2016/12/15.
 * 邮箱：shuicz0505@qq.com
 * ( ゜- ゜)つロ  ( ゜- ゜)つロ  ( ゜- ゜)つロ  ( ゜- ゜)つロ
 * ( ゜- ゜)つロ  ( ゜- ゜)つロ  ( ゜- ゜)つロ  ( ゜- ゜)つロ
 * ( ゜- ゜)つロ  ( ゜- ゜)つロ  ( ゜- ゜)つロ  ( ゜- ゜)つロ
 */


public class TXTJokerEntity implements Serializable {
    private static final long serialVersionUID = 4605780146151646593L;

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":1069,"ret_code":0,"contentlist":[{"id":"58527f3a6e3660dfaa590771","title":"人长得丑不丑真的没关","text":"人长得丑不丑真的没关系，只要看不到自己丑就行了。。。","type":1,"ct":"2016-12-15 19:32:10.119"},{"id":"58527f3a6e3660dfaa590770","title":"一日我问我同桌：我们","text":"一日我问我同桌：我们为什么要学地理啊？\r\n同桌：因为这个世界没天理啊。\r\n我：我竟无言以对。。。","type":1,"ct":"2016-12-15 19:32:10.118"},{"id":"585278f26e3660dfaa58e4f6","title":"\u201c老师，我200多分","text":"\u201c老师，我200多分能去警校么\u201d\r\n\u201c200多分去警校当警犬吧\u201d","type":1,"ct":"2016-12-15 19:05:22.727"},{"id":"585263d66e3660dfaa58b2ab","text":"老鼠和猫相遇，老鼠颤抖地对猫说：我是不是该安静地走开？猫微笑着说：你知道我在等你吗？老鼠哭喊：为什么受伤的总是我！猫大笑：因为牵挂你的人是我。","title":"动物的开心冷笑话","type":1,"ct":"2016-12-15 17:35:18.174"},{"id":"585263d56e3660dfaa58b2aa","text":"小时侯，虎哥和虎弟在玩老虎、杠子、鸡的游戏。虎哥说：\u201c老虎１虎弟说：\u201c鸡１老虎吃鸡，虎弟输了，气得直哭。虎妈妈冲虎哥嚷道：\u201c瞧你弟弟都哭了，你就不能说虫子？\u201d虎哥说：\u201c我实话实说有什么错？它说假话倒有理了？\u201d","title":"虎哥的开心冷幽默","type":1,"ct":"2016-12-15 17:35:17.964"},{"id":"585263d56e3660dfaa58b2a9","text":"屎壳郎：俺是世界级球星，脚下技术细腻，尤其善于个人盘带。","title":"足球场上的动物","type":1,"ct":"2016-12-15 17:35:17.964"},{"id":"5852553b6e3660dfaa5881a3","title":"今天看一个女孩可怜，","text":"今天看一个女孩可怜，衣着单薄，在寒风中瑟瑟发抖，我就捐给她200块钱，她很感动，决定报答我！警察叔叔，事情经过就是这样的。","type":1,"ct":"2016-12-15 16:32:59.880"},{"id":"58524d9a6e3660dfaa58521b","title":"记得上小学6年级的时","text":"记得上小学6年级的时候，女生还没有穿罩罩，坐我斜对面的妹子袖口很大，于是上课的时候没事一直在研究，突然感觉谁在看我，通过另一个袖口看见一张猥琐的笑脸，相视一笑，各忙各的。。。","type":1,"ct":"2016-12-15 16:00:26.838"},{"id":"585247396e3660dfaa5846c0","text":"<p>\r\n\t\t1、同事：小伙子还在加班吗？<p><\/p>\r\n我是啊！刚来业务不熟加班多多熟悉业务。<p><\/p>\r\n同事：嗯，不错啊，挺积极啊，有前途。你让我想起一个同事他以前和你一样天天加班，最后。。。<p><\/p>\r\n我：最后加薪了还是升职了？<p><\/p>\r\n同事：不是，最后他老婆和别人跑了，哈哈。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一单身女子搬了家，晚上忽然停电，她想起家里没有蜡烛。。。<p><\/p>\r\n这时，有人敲门，原来是隔壁的小孩子。<p><\/p>\r\n只见他紧张地问：\u201c阿姨，你家有蜡烛吗？\u201d<p><\/p>\r\n女子心想：天哪，刚来就借东西，以后就更没完没了了。<p><\/p>......","title":"满满的笑能量,传递在生活中","type":1,"ct":"2016-12-15 15:33:13.481"},{"id":"585247396e3660dfaa5846bf","text":"<p>\r\n\t\t1、\u201c儿子，以后记得别娶了媳妇儿忘了娘。\u201d<p><\/p>\r\n\u201c放心吧妈，我会一直娘下去的。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、闺蜜生病了，她打电话来给我说：亲爱的，我好像发烧了。<p><\/p>\r\n我说：去看医生埃<p><\/p>\r\n没想到这货说：神经病，生病为啥看医生，我应该去医院看玻\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、\u201c打劫！ \u201d<p><\/p>\r\n\u201c大哥，我洗好澡出来遛弯，没带钱！ \u201d<p><\/p>\r\n\u201c少废话，给我搜！ \u201d<p><\/p>\r\n\u201c大哥，士可杀不可辱，我也是个刚烈之人！ \u201d<p><\/p>\r\n\u201c劳资劫财不劫色，你特么肛裂管我屁事！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、我：老板，我觉得员工偷吃也并非坏事，这至少证明了我们的食品绿色安全埃<p><\/p>......","title":"逗B特别冷,笑味也很浓","type":1,"ct":"2016-12-15 15:33:13.477"},{"id":"585247396e3660dfaa5846be","text":"<p>\r\n\t\t1、鲁迅：大夫，我妻子检查结果怎么样？<p><\/p>\r\n医生：夫人怀了两个小孩，一个是你的。。。<p><\/p>\r\n鲁迅：啊？？<p><\/p>\r\n医生：还有一个也是你的。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一位朋友说他是搞收藏的，收藏了很多价值不菲的宝贝。<p><\/p>\r\n我说能不能让我也见识一下，只见他不慌不忙打开电脑，进入了某宝。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一天晚上，包拯包大人与展昭展护卫饭后信步与花园中。<p><\/p>\r\n这时展昭突然对包拯问：\u201c大人，我有一事一直好奇，就是您头上的那个月牙到底是怎么来的？\u201d<p><\/p>\r\n包拯听后回答：\u201c第一，我这个月牙的疤痕是小时候不小心磕的。第二，你TM现在看的是真的月亮，老子在你身后！！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、唐僧师徒四人去西天取经，沙僧是个细心的人，一天看见猴子的裤子坏了个洞，便找针补起来。。。<p><\/p>......","title":"东拉西扯的冷幽默,冻死人","type":1,"ct":"2016-12-15 15:33:13.447"},{"id":"585247396e3660dfaa5846bd","text":"<p>\r\n\t\t1、\u201c新买了一个128g的U盘，只花了15块。\u201d<p><\/p>\r\n\u201c这么便宜，不是买到假货了吧？\u201d<p><\/p>\r\n\u201c真货，我称过了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、老王四十多岁开始谢顶，于是整个人都变得很敏感，经不起别人说自己秃。 <p><\/p>\r\n有一天有一辆拖拉机从老王身边驶过，老王整个人都崩溃了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、跟人干了一仗，那人是个秃瓢\u2026\u2026<p><\/p>\r\nPol.ice：\u201c你怎么打的，把人一头秀发打没了？\u201d<p><\/p>\r\n我：\u201c他本来就是秃子啊！ \u201d<p><\/p>\r\nPol.ice：\u201c人家咬定说是你打没的！ \u201d<p><\/p>\r\n我：\u201c那我也受伤了，很严重，我胳膊被他打伤了。\u201d<p><\/p>......","title":"爆囧,冷的都想穿羽绒服","type":1,"ct":"2016-12-15 15:33:13.446"},{"id":"585247396e3660dfaa5846bc","text":"<p>\r\n\t\t1、一少年因为赌球输光了全部身家，爬上了天台，不一会儿亲戚都来到了楼下，还有公安，消防员，当然也少不了围观群众，挤满了人，都在劝说少年要坚强，不能随意放弃自己宝贵的生命。。。<p><\/p>\r\n最后，少年死于密集恐惧症。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、施主：\u201c大师，以前是跌得难受，现在是涨得难受，做股票咋这么苦呢？\u201d<p><\/p>\r\n禅师：\u201c你收盘后再来。\u201d<p><\/p>\r\n施主：\u201c你的意思是要想成为一名优秀的投资人，我要勇于面对盘面的蹂躏？\u201d<p><\/p>\r\n禅师：\u201c交易时间不要影响我下单。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、台湾教育界做了个有趣的实验，让台湾和大陆的小朋友抄写\u201c忧郁的台湾乌龟\u201d100遍，经过观察他们发现台湾小朋友抄了十几遍后就不耐烦了，而大陆小朋友每次都能坚持抄完，教育专家们由此断定大陆小朋友缺乏反抗精神。<p><\/p>......","title":"笑而不语,想不到的冷","type":1,"ct":"2016-12-15 15:33:13.431"},{"id":"585247396e3660dfaa5846bb","text":"<p>\r\n\t\t1、A：男人为什么喜欢海啊？<p><\/p>\r\nB：因为海的\u2018波\u2019大啊！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、看了西游之后我总结了一下发现，悟空一定是个女的：<p><\/p>\r\n第一、老唐给他织了一条虎皮裙他高兴疯了；<p><\/p>\r\n第二、他有定身术确从不调戏美女；<p><\/p>\r\n第三、只要是漂亮的女妖直接打死；<p><\/p>\r\n第四、他有一根能大能小的棒子。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、小明：我最喜欢小鸟自由的飞翔。<p><\/p>\r\n小红：说人话。<p><\/p>\r\n小明：我不喜欢穿短裤。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、天气渐渐热了，好想摆个地摊，卖点女同胞们感兴趣的小玩意，段友们给点意见呗：卖镜子吧，记住，一定要平放地上卖！\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、女：床上我听你的，下床你听我的，如何？<p><\/p>......","title":"爆笑内涵帝,乐你笑弯腰","type":1,"ct":"2016-12-15 15:33:13.431"},{"id":"585247396e3660dfaa5846ba","text":"<p>\r\n\t\t1、我上班就是为了钱，跟我谈什么狗屁理想啊！我的理想就是不上班。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、我必需要努力赚钱了，要不人家会说这个人除了帅，就一无是处了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、媳妇怀孕了，天天吃好多水果，还说吃水果生的娃娃水灵白净，晚上我买了一筐大黄梨，心里琢磨着，这下怎么也得生个土豪金的娃吧，天生富贵啊！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、今天在朋友圈里发现一个平时很屌的高富帅发了个说说：隔壁偷到的wife一点也不好用！<p><\/p>\r\n当时我就笑了，还TM装B呢！偷网不说，连TM   wifi都拼错了！\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、很多单身的小伙子都认为：有个女朋友陪在身边是最幸福的，其实不然，像我这样的男人，感觉最幸福的事就是\u2014\u2014媳妇儿今天没打我。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、中午出去吃饭，在菜里吃出一根头发，我连忙把他们厨师叫出来，指着头发问他：\u201c你要做个护理么？都分叉了！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t7、有一种人，看起来挺穷的，其实超级有钱，还有一种人，看起来超级有钱，其实特别特别有钱。我和他们都不一样，我是那种看起来挺穷的，其实特别特别穷。\r\n\t<\/p>\r\n\t<p>\r\n\t\t8、今天感觉很不舒服，于是请假去医院看病，医生看了看对我说：\u201c你病得不轻啊！ \u201d<p><\/p>......","title":"逗B成了非常流行的娱乐项目","type":1,"ct":"2016-12-15 15:33:13.364"},{"id":"585247396e3660dfaa5846b9","text":"<p>\r\n\t\t1、叛逆和叛变区别是？<p><\/p>\r\n神回复：\u201c 叛逆就是瞒着爸妈去开房，叛变就是瞒着男友去开房 \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、大便时最痛苦的是发生了什么事情？<p><\/p>\r\n神回复：是没带纸吗？错，是带了纸没用上。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、\u201c如何形容一个人很丑，但又不能太直接呢？\u201d<p><\/p>\r\n神回复：\u201c这是一个看脸的时代，而你不属于这个时代。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、\u201c什么是团结?\u201d<p><\/p>\r\n\u201c两块钱你什么都买不了，而一亿个两块钱，却能买很多东西。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、女人：\u201c男人在付钱的时候最帅。\u201d<p><\/p>\r\n黑老大神回复：\u201c那为什么给我们交保护费的男人都那么怂呢？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、\u201c怎么你小小年纪就近视了？\u201d<p><\/p>......","title":"笑果不凡的高冷神回复","type":1,"ct":"2016-12-15 15:33:13.273"},{"id":"585247396e3660dfaa5846b8","text":"<p>\r\n\t\t1、今天在路上，有个小贩对我招呼 ：先生用的智能机？来一个移动电源吧！<p><\/p>\r\n我说：谢谢，我用的是联通卡！不用移动的电源！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一警察巡逻，发现银行门口一车违规停靠，便上前准备开罚单时，从银行里跑出一蒙面人冲他喊叫：\u201c喂，先别开罚单，我们抢完银行马上就走。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、早上去自动售货机买饮料，投币之后按了一瓶三块的饮料，居然一下出来三瓶，之后我又投进三个硬币，居然给我吞了。<p><\/p>\r\n这是告诉我做人不要太贪吗？\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、今天感冒去诊所拿药，大夫检查了一下：没什么事，不用吃药打针，多吃点水果喝点水就好了！<p><\/p>......","title":"笑话越冷越好,谁让夏天来了呢","type":1,"ct":"2016-12-15 15:33:13.273"},{"id":"585247396e3660dfaa5846b7","text":"<p>\r\n\t\t1、\u201c你在什么时侯会想起你的前任？\u201d<p><\/p>\r\n\u201c有人出殡的时侯。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、什么事让你发现这个人不能深交？<p><\/p>\r\n发朋友圈的图只P自己。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、问：用什么方法可以泡到纯情的女孩子？<p><\/p>\r\n答：耐心和爱心，而且要有远见，扶孕妇过马路记下她的电话。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、问：\u201c偶像派什么意思？\u201d<p><\/p>\r\n答：\u201c我长得像饼。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、如何在东北获得好人缘？<p><\/p>\r\n请聊天时常用：\u201c还是你牛逼！ \u201d、\u201c那谁能有你朋友多！ \u201d、\u201c咱哥俩谁跟谁！ \u201d、\u201c最讲究的还是你！ \u201d、\u201c你这也不是怕嫂子，就是不和她一般见识！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、\u201c既然台式机的游戏性能那么好，为什么还会有那么人买笔记本打游戏？\u201d<p><\/p>......","title":"神回复它是个冷笑话","type":1,"ct":"2016-12-15 15:33:13.273"},{"id":"585247396e3660dfaa5846b6","text":"<p>\r\n\t\t1、为什么我期盼国家强大？因为我想在70岁时能泡上一个神往中国的外国妞！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、天越来越热了，怕热弄了个大光头，这两天发现去学车教练变得客气了，再也不给脸色看了，去菜市场买点水果也够称了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、根据调查发现，迄今为止，90后还没有一位活过30岁的，真是令人感到担忧。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、网吧的厕所标语：穿越火线爆不了头怎么办？英雄联盟补不上兵怎么办？你先尿准了再说！！！\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、不管是《花儿与少年》，还是《花样姐姐》都在告诉我们一个道理：跟团旅游烦死人。\r\n......","title":"爆冷蛇精病,总跟别人不一样","type":1,"ct":"2016-12-15 15:33:13.272"},{"id":"585247396e3660dfaa5846b5","text":"<p>\r\n\t\t1、昨天大家正在野餐，旁边一阵引擎声呼啸而过，我对着声音消失的方向大喊：\u201c有钱了不起阿！？\u201d<p><\/p>\r\n同行的默默说了一句\u201c那是摩托车。。。\u201d<p><\/p>\r\n\u201c噢。。。\u201d我再一次用力喊道：\u201c没钱屌什么屌啊！？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、\u201c你这混蛋，这是二十万，快离开我女儿。\u201d<p><\/p>\r\n\u201c你TM放尊重一点，我这是绑架啊！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、车前有个小伙子，向后跳了一下摔倒在地，用很痛苦的表情看着我。<p><\/p>\r\n我：\u201c没撞到你啊，怎么年纪轻轻就讹人啊？\u201d <p><\/p>\r\n小伙子：\u201c谁能证明，你有装行车记录仪吗？\u201d<p><\/p>......","title":"逗B搞笑有威力,笑尿你","type":1,"ct":"2016-12-15 15:33:13.272"}],"currentPage":1,"allNum":21376,"maxResult":20}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    private ShowapiResBodyBean showapi_res_body;

    public static TXTJokerEntity objectFromData(String str) {

        return new Gson().fromJson(str, TXTJokerEntity.class);
    }

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * allPages : 1069
         * ret_code : 0
         * contentlist : [{"id":"58527f3a6e3660dfaa590771","title":"人长得丑不丑真的没关","text":"人长得丑不丑真的没关系，只要看不到自己丑就行了。。。","type":1,"ct":"2016-12-15 19:32:10.119"},{"id":"58527f3a6e3660dfaa590770","title":"一日我问我同桌：我们","text":"一日我问我同桌：我们为什么要学地理啊？\r\n同桌：因为这个世界没天理啊。\r\n我：我竟无言以对。。。","type":1,"ct":"2016-12-15 19:32:10.118"},{"id":"585278f26e3660dfaa58e4f6","title":"\u201c老师，我200多分","text":"\u201c老师，我200多分能去警校么\u201d\r\n\u201c200多分去警校当警犬吧\u201d","type":1,"ct":"2016-12-15 19:05:22.727"},{"id":"585263d66e3660dfaa58b2ab","text":"老鼠和猫相遇，老鼠颤抖地对猫说：我是不是该安静地走开？猫微笑着说：你知道我在等你吗？老鼠哭喊：为什么受伤的总是我！猫大笑：因为牵挂你的人是我。","title":"动物的开心冷笑话","type":1,"ct":"2016-12-15 17:35:18.174"},{"id":"585263d56e3660dfaa58b2aa","text":"小时侯，虎哥和虎弟在玩老虎、杠子、鸡的游戏。虎哥说：\u201c老虎１虎弟说：\u201c鸡１老虎吃鸡，虎弟输了，气得直哭。虎妈妈冲虎哥嚷道：\u201c瞧你弟弟都哭了，你就不能说虫子？\u201d虎哥说：\u201c我实话实说有什么错？它说假话倒有理了？\u201d","title":"虎哥的开心冷幽默","type":1,"ct":"2016-12-15 17:35:17.964"},{"id":"585263d56e3660dfaa58b2a9","text":"屎壳郎：俺是世界级球星，脚下技术细腻，尤其善于个人盘带。","title":"足球场上的动物","type":1,"ct":"2016-12-15 17:35:17.964"},{"id":"5852553b6e3660dfaa5881a3","title":"今天看一个女孩可怜，","text":"今天看一个女孩可怜，衣着单薄，在寒风中瑟瑟发抖，我就捐给她200块钱，她很感动，决定报答我！警察叔叔，事情经过就是这样的。","type":1,"ct":"2016-12-15 16:32:59.880"},{"id":"58524d9a6e3660dfaa58521b","title":"记得上小学6年级的时","text":"记得上小学6年级的时候，女生还没有穿罩罩，坐我斜对面的妹子袖口很大，于是上课的时候没事一直在研究，突然感觉谁在看我，通过另一个袖口看见一张猥琐的笑脸，相视一笑，各忙各的。。。","type":1,"ct":"2016-12-15 16:00:26.838"},{"id":"585247396e3660dfaa5846c0","text":"<p>\r\n\t\t1、同事：小伙子还在加班吗？<p><\/p>\r\n我是啊！刚来业务不熟加班多多熟悉业务。<p><\/p>\r\n同事：嗯，不错啊，挺积极啊，有前途。你让我想起一个同事他以前和你一样天天加班，最后。。。<p><\/p>\r\n我：最后加薪了还是升职了？<p><\/p>\r\n同事：不是，最后他老婆和别人跑了，哈哈。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一单身女子搬了家，晚上忽然停电，她想起家里没有蜡烛。。。<p><\/p>\r\n这时，有人敲门，原来是隔壁的小孩子。<p><\/p>\r\n只见他紧张地问：\u201c阿姨，你家有蜡烛吗？\u201d<p><\/p>\r\n女子心想：天哪，刚来就借东西，以后就更没完没了了。<p><\/p>......","title":"满满的笑能量,传递在生活中","type":1,"ct":"2016-12-15 15:33:13.481"},{"id":"585247396e3660dfaa5846bf","text":"<p>\r\n\t\t1、\u201c儿子，以后记得别娶了媳妇儿忘了娘。\u201d<p><\/p>\r\n\u201c放心吧妈，我会一直娘下去的。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、闺蜜生病了，她打电话来给我说：亲爱的，我好像发烧了。<p><\/p>\r\n我说：去看医生埃<p><\/p>\r\n没想到这货说：神经病，生病为啥看医生，我应该去医院看玻\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、\u201c打劫！ \u201d<p><\/p>\r\n\u201c大哥，我洗好澡出来遛弯，没带钱！ \u201d<p><\/p>\r\n\u201c少废话，给我搜！ \u201d<p><\/p>\r\n\u201c大哥，士可杀不可辱，我也是个刚烈之人！ \u201d<p><\/p>\r\n\u201c劳资劫财不劫色，你特么肛裂管我屁事！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、我：老板，我觉得员工偷吃也并非坏事，这至少证明了我们的食品绿色安全埃<p><\/p>......","title":"逗B特别冷,笑味也很浓","type":1,"ct":"2016-12-15 15:33:13.477"},{"id":"585247396e3660dfaa5846be","text":"<p>\r\n\t\t1、鲁迅：大夫，我妻子检查结果怎么样？<p><\/p>\r\n医生：夫人怀了两个小孩，一个是你的。。。<p><\/p>\r\n鲁迅：啊？？<p><\/p>\r\n医生：还有一个也是你的。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一位朋友说他是搞收藏的，收藏了很多价值不菲的宝贝。<p><\/p>\r\n我说能不能让我也见识一下，只见他不慌不忙打开电脑，进入了某宝。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一天晚上，包拯包大人与展昭展护卫饭后信步与花园中。<p><\/p>\r\n这时展昭突然对包拯问：\u201c大人，我有一事一直好奇，就是您头上的那个月牙到底是怎么来的？\u201d<p><\/p>\r\n包拯听后回答：\u201c第一，我这个月牙的疤痕是小时候不小心磕的。第二，你TM现在看的是真的月亮，老子在你身后！！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、唐僧师徒四人去西天取经，沙僧是个细心的人，一天看见猴子的裤子坏了个洞，便找针补起来。。。<p><\/p>......","title":"东拉西扯的冷幽默,冻死人","type":1,"ct":"2016-12-15 15:33:13.447"},{"id":"585247396e3660dfaa5846bd","text":"<p>\r\n\t\t1、\u201c新买了一个128g的U盘，只花了15块。\u201d<p><\/p>\r\n\u201c这么便宜，不是买到假货了吧？\u201d<p><\/p>\r\n\u201c真货，我称过了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、老王四十多岁开始谢顶，于是整个人都变得很敏感，经不起别人说自己秃。 <p><\/p>\r\n有一天有一辆拖拉机从老王身边驶过，老王整个人都崩溃了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、跟人干了一仗，那人是个秃瓢\u2026\u2026<p><\/p>\r\nPol.ice：\u201c你怎么打的，把人一头秀发打没了？\u201d<p><\/p>\r\n我：\u201c他本来就是秃子啊！ \u201d<p><\/p>\r\nPol.ice：\u201c人家咬定说是你打没的！ \u201d<p><\/p>\r\n我：\u201c那我也受伤了，很严重，我胳膊被他打伤了。\u201d<p><\/p>......","title":"爆囧,冷的都想穿羽绒服","type":1,"ct":"2016-12-15 15:33:13.446"},{"id":"585247396e3660dfaa5846bc","text":"<p>\r\n\t\t1、一少年因为赌球输光了全部身家，爬上了天台，不一会儿亲戚都来到了楼下，还有公安，消防员，当然也少不了围观群众，挤满了人，都在劝说少年要坚强，不能随意放弃自己宝贵的生命。。。<p><\/p>\r\n最后，少年死于密集恐惧症。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、施主：\u201c大师，以前是跌得难受，现在是涨得难受，做股票咋这么苦呢？\u201d<p><\/p>\r\n禅师：\u201c你收盘后再来。\u201d<p><\/p>\r\n施主：\u201c你的意思是要想成为一名优秀的投资人，我要勇于面对盘面的蹂躏？\u201d<p><\/p>\r\n禅师：\u201c交易时间不要影响我下单。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、台湾教育界做了个有趣的实验，让台湾和大陆的小朋友抄写\u201c忧郁的台湾乌龟\u201d100遍，经过观察他们发现台湾小朋友抄了十几遍后就不耐烦了，而大陆小朋友每次都能坚持抄完，教育专家们由此断定大陆小朋友缺乏反抗精神。<p><\/p>......","title":"笑而不语,想不到的冷","type":1,"ct":"2016-12-15 15:33:13.431"},{"id":"585247396e3660dfaa5846bb","text":"<p>\r\n\t\t1、A：男人为什么喜欢海啊？<p><\/p>\r\nB：因为海的\u2018波\u2019大啊！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、看了西游之后我总结了一下发现，悟空一定是个女的：<p><\/p>\r\n第一、老唐给他织了一条虎皮裙他高兴疯了；<p><\/p>\r\n第二、他有定身术确从不调戏美女；<p><\/p>\r\n第三、只要是漂亮的女妖直接打死；<p><\/p>\r\n第四、他有一根能大能小的棒子。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、小明：我最喜欢小鸟自由的飞翔。<p><\/p>\r\n小红：说人话。<p><\/p>\r\n小明：我不喜欢穿短裤。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、天气渐渐热了，好想摆个地摊，卖点女同胞们感兴趣的小玩意，段友们给点意见呗：卖镜子吧，记住，一定要平放地上卖！\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、女：床上我听你的，下床你听我的，如何？<p><\/p>......","title":"爆笑内涵帝,乐你笑弯腰","type":1,"ct":"2016-12-15 15:33:13.431"},{"id":"585247396e3660dfaa5846ba","text":"<p>\r\n\t\t1、我上班就是为了钱，跟我谈什么狗屁理想啊！我的理想就是不上班。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、我必需要努力赚钱了，要不人家会说这个人除了帅，就一无是处了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、媳妇怀孕了，天天吃好多水果，还说吃水果生的娃娃水灵白净，晚上我买了一筐大黄梨，心里琢磨着，这下怎么也得生个土豪金的娃吧，天生富贵啊！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、今天在朋友圈里发现一个平时很屌的高富帅发了个说说：隔壁偷到的wife一点也不好用！<p><\/p>\r\n当时我就笑了，还TM装B呢！偷网不说，连TM   wifi都拼错了！\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、很多单身的小伙子都认为：有个女朋友陪在身边是最幸福的，其实不然，像我这样的男人，感觉最幸福的事就是\u2014\u2014媳妇儿今天没打我。。。\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、中午出去吃饭，在菜里吃出一根头发，我连忙把他们厨师叫出来，指着头发问他：\u201c你要做个护理么？都分叉了！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t7、有一种人，看起来挺穷的，其实超级有钱，还有一种人，看起来超级有钱，其实特别特别有钱。我和他们都不一样，我是那种看起来挺穷的，其实特别特别穷。\r\n\t<\/p>\r\n\t<p>\r\n\t\t8、今天感觉很不舒服，于是请假去医院看病，医生看了看对我说：\u201c你病得不轻啊！ \u201d<p><\/p>......","title":"逗B成了非常流行的娱乐项目","type":1,"ct":"2016-12-15 15:33:13.364"},{"id":"585247396e3660dfaa5846b9","text":"<p>\r\n\t\t1、叛逆和叛变区别是？<p><\/p>\r\n神回复：\u201c 叛逆就是瞒着爸妈去开房，叛变就是瞒着男友去开房 \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、大便时最痛苦的是发生了什么事情？<p><\/p>\r\n神回复：是没带纸吗？错，是带了纸没用上。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、\u201c如何形容一个人很丑，但又不能太直接呢？\u201d<p><\/p>\r\n神回复：\u201c这是一个看脸的时代，而你不属于这个时代。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、\u201c什么是团结?\u201d<p><\/p>\r\n\u201c两块钱你什么都买不了，而一亿个两块钱，却能买很多东西。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、女人：\u201c男人在付钱的时候最帅。\u201d<p><\/p>\r\n黑老大神回复：\u201c那为什么给我们交保护费的男人都那么怂呢？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、\u201c怎么你小小年纪就近视了？\u201d<p><\/p>......","title":"笑果不凡的高冷神回复","type":1,"ct":"2016-12-15 15:33:13.273"},{"id":"585247396e3660dfaa5846b8","text":"<p>\r\n\t\t1、今天在路上，有个小贩对我招呼 ：先生用的智能机？来一个移动电源吧！<p><\/p>\r\n我说：谢谢，我用的是联通卡！不用移动的电源！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一警察巡逻，发现银行门口一车违规停靠，便上前准备开罚单时，从银行里跑出一蒙面人冲他喊叫：\u201c喂，先别开罚单，我们抢完银行马上就走。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、早上去自动售货机买饮料，投币之后按了一瓶三块的饮料，居然一下出来三瓶，之后我又投进三个硬币，居然给我吞了。<p><\/p>\r\n这是告诉我做人不要太贪吗？\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、今天感冒去诊所拿药，大夫检查了一下：没什么事，不用吃药打针，多吃点水果喝点水就好了！<p><\/p>......","title":"笑话越冷越好,谁让夏天来了呢","type":1,"ct":"2016-12-15 15:33:13.273"},{"id":"585247396e3660dfaa5846b7","text":"<p>\r\n\t\t1、\u201c你在什么时侯会想起你的前任？\u201d<p><\/p>\r\n\u201c有人出殡的时侯。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、什么事让你发现这个人不能深交？<p><\/p>\r\n发朋友圈的图只P自己。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、问：用什么方法可以泡到纯情的女孩子？<p><\/p>\r\n答：耐心和爱心，而且要有远见，扶孕妇过马路记下她的电话。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、问：\u201c偶像派什么意思？\u201d<p><\/p>\r\n答：\u201c我长得像饼。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、如何在东北获得好人缘？<p><\/p>\r\n请聊天时常用：\u201c还是你牛逼！ \u201d、\u201c那谁能有你朋友多！ \u201d、\u201c咱哥俩谁跟谁！ \u201d、\u201c最讲究的还是你！ \u201d、\u201c你这也不是怕嫂子，就是不和她一般见识！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、\u201c既然台式机的游戏性能那么好，为什么还会有那么人买笔记本打游戏？\u201d<p><\/p>......","title":"神回复它是个冷笑话","type":1,"ct":"2016-12-15 15:33:13.273"},{"id":"585247396e3660dfaa5846b6","text":"<p>\r\n\t\t1、为什么我期盼国家强大？因为我想在70岁时能泡上一个神往中国的外国妞！\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、天越来越热了，怕热弄了个大光头，这两天发现去学车教练变得客气了，再也不给脸色看了，去菜市场买点水果也够称了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、根据调查发现，迄今为止，90后还没有一位活过30岁的，真是令人感到担忧。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、网吧的厕所标语：穿越火线爆不了头怎么办？英雄联盟补不上兵怎么办？你先尿准了再说！！！\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、不管是《花儿与少年》，还是《花样姐姐》都在告诉我们一个道理：跟团旅游烦死人。\r\n......","title":"爆冷蛇精病,总跟别人不一样","type":1,"ct":"2016-12-15 15:33:13.272"},{"id":"585247396e3660dfaa5846b5","text":"<p>\r\n\t\t1、昨天大家正在野餐，旁边一阵引擎声呼啸而过，我对着声音消失的方向大喊：\u201c有钱了不起阿！？\u201d<p><\/p>\r\n同行的默默说了一句\u201c那是摩托车。。。\u201d<p><\/p>\r\n\u201c噢。。。\u201d我再一次用力喊道：\u201c没钱屌什么屌啊！？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、\u201c你这混蛋，这是二十万，快离开我女儿。\u201d<p><\/p>\r\n\u201c你TM放尊重一点，我这是绑架啊！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、车前有个小伙子，向后跳了一下摔倒在地，用很痛苦的表情看着我。<p><\/p>\r\n我：\u201c没撞到你啊，怎么年纪轻轻就讹人啊？\u201d <p><\/p>\r\n小伙子：\u201c谁能证明，你有装行车记录仪吗？\u201d<p><\/p>......","title":"逗B搞笑有威力,笑尿你","type":1,"ct":"2016-12-15 15:33:13.272"}]
         * currentPage : 1
         * allNum : 21376
         * maxResult : 20
         */

        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        private List<ContentlistBean> contentlist;

        public static ShowapiResBodyBean objectFromData(String str) {

            return new Gson().fromJson(str, ShowapiResBodyBean.class);
        }

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            /**
             * id : 58527f3a6e3660dfaa590771
             * title : 人长得丑不丑真的没关
             * text : 人长得丑不丑真的没关系，只要看不到自己丑就行了。。。
             * type : 1
             * ct : 2016-12-15 19:32:10.119
             */

            private String id;
            private String title;
            private String text;
            private int type;
            private String ct;

            public static ContentlistBean objectFromData(String str) {

                return new Gson().fromJson(str, ContentlistBean.class);
            }

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }
        }
    }
}
